Tabrez-dev/Tiva-TM4C123GXL-Peripheral-Driver-Development/drivers/src/tm4c123x_i2c_driver.c
/*
 * tm4c123x_i2c_driver.c
 *
 *  Created on: Jan 2025
 *      Author: Tabrez
 */

#include "tm4c123x_i2c_driver.h"

/*******************************************************************************
 *                          PRIVATE HELPER FUNCTIONS
 ******************************************************************************/

/*
 * Crystal frequency lookup table
 * Maps XTAL field value to actual crystal frequency in Hz
 * Based on TM4C123GH6PM datasheet Table 5-5
 */
static const uint32_t XTAL_FREQ_TABLE[] = {
    [0x06] = 4000000UL,     /* 4 MHz */
    [0x07] = 4096000UL,     /* 4.096 MHz */
    [0x08] = 4915200UL,     /* 4.9152 MHz */
    [0x09] = 5000000UL,     /* 5 MHz */
    [0x0A] = 5120000UL,     /* 5.12 MHz */
    [0x0B] = 6000000UL,     /* 6 MHz */
    [0x0C] = 6144000UL,     /* 6.144 MHz */
    [0x0D] = 7372800UL,     /* 7.3728 MHz */
    [0x0E] = 8000000UL,     /* 8 MHz */
    [0x0F] = 8192000UL,     /* 8.192 MHz */
    [0x10] = 10000000UL,    /* 10 MHz */
    [0x11] = 12000000UL,    /* 12 MHz */
    [0x12] = 12288000UL,    /* 12.288 MHz */
    [0x13] = 13560000UL,    /* 13.56 MHz */
    [0x14] = 14318180UL,    /* 14.31818 MHz */
    [0x15] = 16000000UL,    /* 16 MHz (TM4C123GXL LaunchPad default) */
    [0x16] = 16384000UL,    /* 16.384 MHz */
    [0x17] = 18000000UL,    /* 18 MHz */
    [0x18] = 20000000UL,    /* 20 MHz */
    [0x19] = 24000000UL,    /* 24 MHz */
    [0x1A] = 25000000UL     /* 25 MHz */
};

/* Oscillator source values */
#define OSC_SOURCE_MOSC         0   /* Main oscillator */
#define OSC_SOURCE_PIOSC        1   /* Precision internal oscillator (16 MHz) */
#define OSC_SOURCE_PIOSC_DIV4   2   /* PIOSC/4 (4 MHz) */
#define OSC_SOURCE_LFIOSC       3   /* Low frequency internal oscillator (30 kHz) */

/* PLL output frequency (always 400 MHz when enabled) */
#define PLL_OUTPUT_FREQ         400000000UL

/* PIOSC frequency (precision internal oscillator) */
#define PIOSC_FREQ              16000000UL

/* I2C clock generation constants */
#define I2C_SCL_LP_NORMAL       6   /* Low period count (standard/fast/fast+) */
#define I2C_SCL_HP_NORMAL       4   /* High period count (standard/fast/fast+) */
#define I2C_CLOCK_FACTOR        (I2C_SCL_LP_NORMAL + I2C_SCL_HP_NORMAL)  /* = 10 */

/* TPR limits */
#define I2C_TPR_MIN             1
#define I2C_TPR_MAX             127

/***********************************************************************************
 * @fn              - RCC_GetSystemClockFreq
 *
 * @brief           - Reads RCC/RCC2 registers to determine actual system clock frequency
 *
 * @return          - System clock frequency in Hz
 *
 * @Note            - Analyzes clock source (MOSC/PIOSC/PLL) and dividers
 */
static uint32_t RCC_GetSystemClockFreq(void)
{
    uint32_t systemClock;
    uint32_t rcc = SYSCTL_CORE->RCC;
    uint32_t rcc2 = SYSCTL_CORE->RCC2;

    /* Step 1: Check if RCC2 is active (bit 31: USERCC2) */
    uint8_t useRCC2 = (rcc2 >> 31) & 0x1;

    /* Step 2: Determine oscillator source */
    uint32_t oscSource;
    if (useRCC2) {
        /* RCC2 OSCSRC2 field (bits 6:4) */
        oscSource = (rcc2 >> 4) & 0x7;
    } else {
        /* RCC OSCSRC field (bits 5:4) */
        oscSource = (rcc >> 4) & 0x3;
    }

    /* Step 3: Get base clock from selected source */
    switch (oscSource) {
        case OSC_SOURCE_MOSC:
        {
            /* Main oscillator - read crystal frequency from XTAL field */
            uint32_t xtal = (rcc >> 6) & 0x1F;  /* XTAL bits 10:6 */
            systemClock = XTAL_FREQ_TABLE[xtal];
            break;
        }

        case OSC_SOURCE_PIOSC:
            /* Precision internal oscillator - always 16 MHz */
            systemClock = PIOSC_FREQ;
            break;

        case OSC_SOURCE_PIOSC_DIV4:
            /* PIOSC divided by 4 */
            systemClock = PIOSC_FREQ / 4;
            break;

        case OSC_SOURCE_LFIOSC:
            /* Low frequency internal oscillator - 30 kHz */
            systemClock = 30000;
            break;

        default:
            /* Fallback to PIOSC */
            systemClock = PIOSC_FREQ;
            break;
    }

    /* Step 4: Check if PLL is being used */
    uint8_t pllBypassed;
    if (useRCC2) {
        /* RCC2 BYPASS2 bit (bit 11) */
        pllBypassed = (rcc2 >> 11) & 0x1;
    } else {
        /* RCC BYPASS bit (bit 11) */
        pllBypassed = (rcc >> 11) & 0x1;
    }

    if (!pllBypassed) {
        /* PLL is active - output is always 400 MHz */
        systemClock = PLL_OUTPUT_FREQ;
    }

    /* Step 5: Apply system clock divider */
    uint8_t useSysDiv;
    uint32_t divisor = 1;

    if (useRCC2) {
        /* Check DIV400 bit (bit 30) */
        uint8_t div400 = (rcc2 >> 30) & 0x1;

        if (div400) {
            /* Using enhanced divider for precise clock frequencies */
            /* SYSDIV2LSB (bit 22) + SYSDIV2 (bits 28:23) form 7-bit divisor */
            uint32_t sysdiv2lsb = (rcc2 >> 22) & 0x1;
            uint32_t sysdiv2 = (rcc2 >> 23) & 0x3F;
            divisor = (sysdiv2 << 1) | sysdiv2lsb;
            divisor += 1;  /* Actual divisor is register value + 1 */
        } else {
            /* Using standard divider */
            useSysDiv = (rcc2 >> 22) & 0x1;  /* USESYSDIV2 bit */
            if (useSysDiv) {
                divisor = ((rcc2 >> 23) & 0x3F) + 1;  /* SYSDIV2 field + 1 */
            }
        }
    } else {
        /* RCC: Check USESYSDIV bit (bit 22) */
        useSysDiv = (rcc >> 22) & 0x1;
        if (useSysDiv) {
            divisor = ((rcc >> 23) & 0xF) + 1;  /* SYSDIV field (4 bits) + 1 */
        }
    }

    /* Apply divisor to get final system clock */
    systemClock = systemClock / divisor;

    return systemClock;
}

/***********************************************************************************
 * @fn              - I2C_CalculateTPR
 *
 * @brief           - Calculates Timer Period Register value for desired I2C SCL speed
 *
 * @param[in]       - Desired I2C SCL frequency in Hz (100000, 400000, 1000000)
 *
 * @return          - TPR value (1-127)
 *
 * @Note            - Formula: TPR = (System_Clock / (2 × 10 × I2C_Speed)) - 1
 *                    Clamps result to valid range (1-127)
 */
static uint8_t I2C_CalculateTPR(uint32_t sclSpeed)
{
    /* Get current system clock frequency */
    uint32_t systemClock = RCC_GetSystemClockFreq();

    /* Calculate TPR using formula from datasheet
     * SCL_PERIOD = 2 × (1 + TPR) × (SCL_LP + SCL_HP) × CLK_PRD
     * Rearranged: TPR = (System_Clock / (2 × 10 × SCL_Frequency)) - 1
     */
    uint32_t tpr = (systemClock / (2 * I2C_CLOCK_FACTOR * sclSpeed)) - 1;

