Tabrez-dev/Tiva-TM4C123GXL-Peripheral-Driver-Development/drivers/src/tm4c123x_i2c_driver.c
    /* Clamp to valid range */
    if (tpr < I2C_TPR_MIN) {
        tpr = I2C_TPR_MIN;
    }
    if (tpr > I2C_TPR_MAX) {
        tpr = I2C_TPR_MAX;
    }

    return (uint8_t)tpr;
}

/*******************************************************************************
 *                          PUBLIC API IMPLEMENTATIONS
 ******************************************************************************/

/***********************************************************************************
 * @fn              - I2C_PeriClockControl
 *
 * @brief           - Enables or disables peripheral clock for I2C module
 *
 * @param[in]       - pI2Cx: Base address of I2C peripheral (I2C0, I2C1, I2C2, I2C3)
 * @param[in]       - EnorDi: ENABLE or DISABLE
 *
 * @return          - none
 *
 * @Note            - Must be called before accessing I2C registers
 */
void I2C_PeriClockControl(I2C_RegDef_t *pI2Cx, uint8_t EnorDi)
{
    if (EnorDi == ENABLE) {
        /* Enable clock by setting appropriate bit in RCGCI2C register */
        if (pI2Cx == I2C0) {
            I2C0_PCLK_EN();
        } else if (pI2Cx == I2C1) {
            I2C1_PCLK_EN();
        } else if (pI2Cx == I2C2) {
            I2C2_PCLK_EN();
        } else if (pI2Cx == I2C3) {
            I2C3_PCLK_EN();
        }

        /* Wait for peripheral to be ready (check PRI2C register) */
        while (!(SYSCTL_PR->PRI2C & (1 << ((((uint32_t)pI2Cx - I2C_0_BASEADDR) / 0x1000)))));

    } else {
        /* Disable clock by clearing bit in RCGCI2C register */
        if (pI2Cx == I2C0) {
            SYSCTL_RUNCLK->RCGCI2C &= ~(1U << 0);
        } else if (pI2Cx == I2C1) {
            SYSCTL_RUNCLK->RCGCI2C &= ~(1U << 1);
        } else if (pI2Cx == I2C2) {
            SYSCTL_RUNCLK->RCGCI2C &= ~(1U << 2);
        } else if (pI2Cx == I2C3) {
            SYSCTL_RUNCLK->RCGCI2C &= ~(1U << 3);
        }
    }
}

/***********************************************************************************
 * @fn              - I2C_MasterInit
 *
 * @brief           - Initializes I2C peripheral in Master mode
 *
 * @param[in]       - pI2CHandle: Pointer to I2C handle structure
 * @param[in]       - I2C_SCLSpeed: Desired SCL clock speed in Hz
 *                    - I2C_SCL_SPEED_SM (100000 Hz - Standard Mode)
 *                    - I2C_SCL_SPEED_FM (400000 Hz - Fast Mode)
 *                    - I2C_SCL_SPEED_FMP (1000000 Hz - Fast Mode Plus)
 *
 * @return          - none
 *
 * @Note            - GPIO pins must be configured separately for I2C alternate function
 *                    Peripheral clock must be enabled before calling this function
 */
void I2C_MasterInit(I2C_Handle_t *pI2CHandle, uint32_t I2C_SCLSpeed)
{
    /* Note: Peripheral clock must be enabled and peripheral reset must be done
     * by application BEFORE calling this function.
     * For loopback mode: Reset should be done ONCE before both init functions.
     */

    /* Step 1: Clear only master-specific bits, preserve slave configuration
     * Don't use MCR = 0 as it would clear SFE if slave was initialized first
     * After reset, MCR is already 0, so we can skip this step
     */

    /* Step 2: Calculate and configure Timer Period for desired SCL speed
     * TPR determines the I2C clock frequency
     */
    uint8_t tpr = I2C_CalculateTPR(I2C_SCLSpeed);
    pI2CHandle->pI2Cx->MTPR = (tpr & 0x7F);  /* Only lower 7 bits, HS=0 */

    /* Step 3: Enable glitch filter (optional but recommended)
     * Filters out noise spikes on SCL/SDA lines
     * Use |= to preserve any existing slave configuration bits (SFE)
     */
    pI2CHandle->pI2Cx->MCR |= (1 << I2C_MCR_GFE);

    /* Step 4: Enable I2C Master Function
     * Sets MFE bit - peripheral now operates as I2C master
     * Use |= to allow dual master+slave operation (required for loopback mode)
     */
    pI2CHandle->pI2Cx->MCR |= (1 << I2C_MCR_MFE);
}

/***********************************************************************************
 * @fn              - I2C_SlaveInit
 *
 * @brief           - Initializes I2C peripheral in Slave mode
 *
 * @param[in]       - pI2CHandle: Pointer to I2C handle structure
 * @param[in]       - SlaveAddr: 7-bit slave address (0x00 to 0x7F)
 *
 * @return          - none
 *
 * @Note            - GPIO pins must be configured separately for I2C alternate function
 *                    Peripheral clock must be enabled before calling this function
 *                    Slave does not configure clock speed (uses master's clock)
 */
void I2C_SlaveInit(I2C_Handle_t *pI2CHandle, uint8_t SlaveAddr)
{
    /* Note: Peripheral clock must be enabled by application BEFORE calling this function */

    /* Step 1: Enable glitch filter FIRST (optional but recommended)
     * Filters out noise spikes on SCL/SDA lines
     * Note: Use OR to preserve any existing MCR bits (e.g., MFE for loopback mode)
     */
    pI2CHandle->pI2Cx->MCR |= (1 << I2C_MCR_GFE);

    /* Step 2: Enable I2C Slave Function BEFORE writing SOAR
     * CRITICAL: SOAR register is write-protected unless SFE is enabled first!
     * This is an undocumented hardware requirement discovered through testing
     */
    pI2CHandle->pI2Cx->MCR |= (1 << I2C_MCR_SFE);

    /* Step 3: Set slave own address (NOW that SFE is enabled)
     * This is the address the slave will respond to on the I2C bus
     * SOAR writes will be ignored if SFE=0!
     */
    pI2CHandle->pI2Cx->SOAR = (SlaveAddr & 0x7F);  /* 7-bit address only */

    /* Step 4: Activate slave device (CRITICAL for slave operation!)
     * Per datasheet Section 16.6 Register 14:
     * "Once this bit has been set, it should not be set again unless it has
     *  been cleared by writing a 0 or by a reset, otherwise transfer failures
     *  may occur."
     *
     * Solution: Always clear DA first, then set it to avoid transfer failures
     * from repeated initializations during debugging
     */
    pI2CHandle->pI2Cx->SCSR = 0;                 /* Clear DA bit first */
    pI2CHandle->pI2Cx->SCSR = (1 << I2C_SCSR_DA); /* Now activate slave */
}

/***********************************************************************************
 * @fn              - I2C_DeInit
 *
 * @brief           - De-initializes I2C peripheral (resets to default state)
 *
 * @param[in]       - pI2Cx: Base address of I2C peripheral
 *
 * @return          - none
 *
 * @Note            - Uses software reset via SRI2C register
 */
void I2C_DeInit(I2C_RegDef_t *pI2Cx)
{
    /* Reset peripheral using appropriate reset macro */
    if (pI2Cx == I2C0) {
        I2C0_RESET();
    } else if (pI2Cx == I2C1) {
        I2C1_RESET();
    } else if (pI2Cx == I2C2) {
        I2C2_RESET();
    } else if (pI2Cx == I2C3) {
        I2C3_RESET();
    }
}

/***********************************************************************************
 * @fn              - I2C_GetFlagStatus
 *
 * @brief           - Returns the status of specified I2C flag
 *
 * @param[in]       - pI2Cx: Base address of I2C peripheral
 * @param[in]       - FlagName: Flag to check (I2C_FLAG_BUSY, I2C_FLAG_ERROR, etc.)
 *
 * @return          - FLAG_SET or FLAG_RESET
 *
 * @Note            - Reads MCS register status bits
 */
uint8_t I2C_GetFlagStatus(I2C_RegDef_t *pI2Cx, uint32_t FlagName)
{
    if (pI2Cx->MCS & FlagName) {
        return FLAG_SET;
    }
    return FLAG_RESET;
}

/***********************************************************************************
 * @fn              - I2C_PeripheralControl
 *
 * @brief           - Enables or disables I2C peripheral
 *
 * @param[in]       - pI2Cx: Base address of I2C peripheral
 * @param[in]       - EnorDi: ENABLE or DISABLE
 *
 * @return          - none
 *
 * @Note            - Controls MFE/SFE bits in MCR register
 */
void I2C_PeripheralControl(I2C_RegDef_t *pI2Cx, uint8_t EnorDi)
{
    if (EnorDi == ENABLE) {
        /* Enable both master and slave functions if they were previously configured */
        pI2Cx->MCR |= (1 << I2C_MCR_MFE) | (1 << I2C_MCR_SFE);
    } else {
        /* Disable both master and slave functions */
        pI2Cx->MCR &= ~((1 << I2C_MCR_MFE) | (1 << I2C_MCR_SFE));
    }
}

/***********************************************************************************
 * @fn              - I2C_LoopbackControl
 *
 * @brief           - Enable/disable I2C internal loopback mode for testing
 *
 * @param[in]       - pI2Cx: Base address of I2C peripheral
 * @param[in]       - EnorDi: ENABLE or DISABLE
 *
 * @return          - none
 *
 * @Note            - Loopback mode (MCR.LPBK bit 0) routes master SDA/SCL signals
 *                    to the slave module internally for diagnostic testing
 *                    Datasheet Section 16.3.4: "The SDA and SCL signals from the
 *                    master are tied to the SDA and SCL signals of the slave module"
 */
void I2C_LoopbackControl(I2C_RegDef_t *pI2Cx, uint8_t EnorDi)
{
    if (EnorDi == ENABLE) {
        /* Enable loopback mode: Master → Slave internal routing */
        pI2Cx->MCR |= (1 << I2C_MCR_LPBK);
    } else {
        /* Disable loopback mode: Normal I2C operation */
        pI2Cx->MCR &= ~(1 << I2C_MCR_LPBK);
    }
}

/***********************************************************************************
 *                     I2C MASTER CONTROL SEQUENCE HELPERS
 ***********************************************************************************/

/***********************************************************************************
 * @fn              - I2C_MasterSendSingle
 *
 * @brief           - Generates single byte transmit sequence (START + RUN + STOP)
 *
 * @param[in]       - pI2Cx: Base address of I2C peripheral
 *
 * @return          - none
 *
 * @Note            - MCS = 0x07 (START + RUN + STOP)
 *                    Figure 16-8: Master Single TRANSMIT
 */
void I2C_MasterSendSingle(I2C_RegDef_t *pI2Cx)
{
    /* Single byte transmit: START + RUN + STOP (0x07) */
    pI2Cx->MCS = (1 << I2C_MCS_STOP) | (1 << I2C_MCS_START) | (1 << I2C_MCS_RUN);
}

/***********************************************************************************
 * @fn              - I2C_GenerateStartCondition
 *
 * @brief           - Generates START condition (initiates I2C transfer or repeated START)
 *
 * @param[in]       - pI2Cx: Base address of I2C peripheral
 *
 * @return          - none
 *
 * @Note            - MCS = 0x03 (START + RUN)
 *                    Used for: Burst first byte, repeated START
 *                    Figure 16-10: Master TRANSMIT of Multiple Data Bytes
 */
void I2C_GenerateStartCondition(I2C_RegDef_t *pI2Cx)
{
    /* Generate START + RUN (0x03) */
    pI2Cx->MCS = (1 << I2C_MCS_START) | (1 << I2C_MCS_RUN);
}

/***********************************************************************************
 * @fn              - I2C_MasterBurstContinue
 *
 * @brief           - Continues burst transfer (middle bytes or hold bus for repeated START)
 *
 * @param[in]       - pI2Cx: Base address of I2C peripheral
 *
 * @return          - none
 *
 * @Note            - MCS = 0x01 (RUN only)
 *                    Used for: Burst middle bytes, holding bus without STOP
 *                    Figure 16-10: Master TRANSMIT of Multiple Data Bytes - Middle bytes
 */
void I2C_MasterBurstContinue(I2C_RegDef_t *pI2Cx)
{
    /* Burst continue: RUN only (0x01) */
    pI2Cx->MCS = (1 << I2C_MCS_RUN);
}

/***********************************************************************************
 * @fn              - I2C_GenerateStopCondition
 *
 * @brief           - Generates STOP condition (terminates I2C transfer)
 *
 * @param[in]       - pI2Cx: Base address of I2C peripheral
 *
 * @return          - none
 *
 * @Note            - MCS = 0x05 (STOP + RUN)
 *                    Used for: Burst last byte, terminating transaction
 *                    Figure 16-10: Master TRANSMIT of Multiple Data Bytes - Last byte
 */
void I2C_GenerateStopCondition(I2C_RegDef_t *pI2Cx)
{
    /* Generate STOP + RUN (0x05) */
    pI2Cx->MCS = (1 << I2C_MCS_STOP) | (1 << I2C_MCS_RUN);
}

