Tabrez-dev/Tiva-TM4C123GXL-Peripheral-Driver-Development/drivers/src/tm4c123x_i2c_driver.c
/*******************************************************************************
 *                  STUB IMPLEMENTATIONS (TO BE COMPLETED)
 ******************************************************************************/

/***********************************************************************************
 * @fn              - I2C_MasterSendData
 *
 * @brief           - Transmits data to I2C slave device (blocking mode)
 *
 * @param[in]       - pI2CHandle: Pointer to I2C handle structure
 * @param[in]       - pTxbuffer: Pointer to data buffer to transmit
 * @param[in]       - Len: Number of bytes to send
 * @param[in]       - SlaveAddr: 7-bit I2C slave address
 * @param[in]       - Sr: Repeated start control (I2C_ENABLE_SR or I2C_DISABLE_SR)
 *
 * @return          - none
 *
 * @Note            - This is a blocking call - function waits until transmission completes
 *                    Based on TM4C datasheet Figures 16-8 (single) and 16-10 (burst)
 *                    MCS control sequences:
 *                      Single byte: 0x07 (START + RUN + STOP)
 *                      Burst first: 0x03 (START + RUN)
 *                      Burst middle: 0x01 (RUN only)
 *                      Burst last: 0x05 (STOP + RUN) or 0x01 (RUN if repeated start)
 */
void I2C_MasterSendData(I2C_Handle_t *pI2CHandle, uint8_t *pTxbuffer, uint32_t Len, uint8_t SlaveAddr, uint8_t Sr)
{
    /* Step 1: Configure slave address in MSA register
     * Bits 7:1 = slave address
     * Bit 0 (R/S) = 0 for transmit operation
     */
    pI2CHandle->pI2Cx->MSA = (SlaveAddr << 1);  /* Shift addr left, R/S bit = 0 */

    /* Step 2: Check if single byte or multi-byte transmission */
    if (Len == 1) {
        /*******************************************************************
         * SINGLE BYTE TRANSMISSION (Figure 16-8)
         * Uses simplified single-byte control sequence
         *******************************************************************/

        /* Write data byte to Master Data Register */
        pI2CHandle->pI2Cx->MDR = *pTxbuffer;

        /* Generate single byte transmit sequence: START + RUN + STOP
         * This completes entire transaction in hardware automatically
         */
        I2C_MasterSendSingle(pI2CHandle->pI2Cx);

        /* Wait for operation to complete by polling BUSY bit
         * BUSY bit (bit 0) in MCS clears when operation finishes
         * Add timeout to prevent infinite hang
         */
        volatile uint32_t timeout = 100000;
        while (I2C_GetFlagStatus(pI2CHandle->pI2Cx, I2C_FLAG_BUSY) == FLAG_SET && timeout--);

        /* If timeout, return immediately - check MCS for error flags */
        if (timeout == 0) {
            return;  /* Timeout - transaction didn't complete */
        }

        /* Check for address acknowledgment error (slave didn't respond) */
        if (I2C_GetFlagStatus(pI2CHandle->pI2Cx, I2C_FLAG_ADRACK) == FLAG_SET) {
            return;  /* Slave address not acknowledged - slave not present or wrong address */
        }

        /* Check for other transmission errors
         * ERROR bit indicates general error condition
         */
        if (I2C_GetFlagStatus(pI2CHandle->pI2Cx, I2C_FLAG_ERROR) == FLAG_SET) {
            return;  /* General error occurred */
        }

    } else {
        /*******************************************************************
         * MULTI-BYTE BURST TRANSMISSION (Figure 16-10)
         * Uses three-phase burst control sequence
         *******************************************************************/

        volatile uint32_t timeout;  /* Timeout for BUSY waits */

        /* PHASE 1: First byte - START condition */
        pI2CHandle->pI2Cx->MDR = pTxbuffer[0];  /* Load first data byte */

        /* Generate START condition to initiate burst transfer
         * This initiates burst transfer sequence
         */
        I2C_GenerateStartCondition(pI2CHandle->pI2Cx);

        /* Wait for first byte transmission to complete */
        timeout = 100000;
        while (I2C_GetFlagStatus(pI2CHandle->pI2Cx, I2C_FLAG_BUSY) == FLAG_SET && timeout--);
        if (timeout == 0) return;

        /* Check for address acknowledgment error (slave didn't respond) */
        if (I2C_GetFlagStatus(pI2CHandle->pI2Cx, I2C_FLAG_ADRACK) == FLAG_SET) {
            return;  /* Slave address not acknowledged - slave not present or wrong address */
        }

        /* Check for other errors (arbitration lost, etc.) */
        if (I2C_GetFlagStatus(pI2CHandle->pI2Cx, I2C_FLAG_ERROR) == FLAG_SET) {
            return;  /* General error occurred */
        }

        /* PHASE 2: Middle bytes (if any) - Continue transfer */
        for (uint32_t i = 1; i < (Len - 1); i++) {
            pI2CHandle->pI2Cx->MDR = pTxbuffer[i];  /* Load next data byte */

            /* Generate burst continue sequence: RUN only (no START, no STOP)
             * This continues the burst transfer
             */
            I2C_MasterBurstContinue(pI2CHandle->pI2Cx);

            /* Wait for byte transmission to complete */
            timeout = 100000;
            while (I2C_GetFlagStatus(pI2CHandle->pI2Cx, I2C_FLAG_BUSY) == FLAG_SET && timeout--);
            if (timeout == 0) return;

            /* Check for errors (data NACK, arbitration lost) */
            if (I2C_GetFlagStatus(pI2CHandle->pI2Cx, I2C_FLAG_ERROR) == FLAG_SET) {
                return;
            }
        }

        /* PHASE 3: Last byte - Terminate transfer */
        pI2CHandle->pI2Cx->MDR = pTxbuffer[Len - 1];  /* Load last data byte */

        if (Sr == I2C_DISABLE_SR) {
            /* Normal termination - generate STOP condition
             * This completes the burst transfer and releases the bus
             */
            I2C_GenerateStopCondition(pI2CHandle->pI2Cx);
        } else {
            /* Repeated START mode - hold bus without STOP
             * Bus remains held for next transaction (useful for read-after-write)
             */
            I2C_MasterBurstContinue(pI2CHandle->pI2Cx);
        }

        /* Wait for last byte transmission to complete */
        timeout = 100000;
        while (I2C_GetFlagStatus(pI2CHandle->pI2Cx, I2C_FLAG_BUSY) == FLAG_SET && timeout--);
        if (timeout == 0) return;

        /* Final error check */
        if (I2C_GetFlagStatus(pI2CHandle->pI2Cx, I2C_FLAG_ERROR) == FLAG_SET) {
            return;
        }
    }
}

/*********************************************************************
 * @fn              - I2C_MasterReceiveData
 *
 * @brief           - Master receives data from slave (blocking mode)
 *
 * @param[in]       - pI2CHandle: I2C handle structure
 * @param[in]       - pRxBuffer: pointer to receive buffer
 * @param[in]       - Len: number of bytes to receive
 * @param[in]       - SlaveAddr: 7-bit slave address
 * @param[in]       - Sr: repeated start enable/disable (currently unused)
 *
 * @return          - none
 *
 * @Note            - Based on TM4C123 datasheet Figures 16-9 and 16-11
 *                  - This is a blocking call
 *                  - Always sends STOP condition (no repeated start support yet)
 */
void I2C_MasterReceiveData(I2C_Handle_t *pI2CHandle, uint8_t *pRxBuffer, uint32_t Len, uint8_t SlaveAddr, uint8_t Sr)
{
    volatile uint32_t timeout;

