Tabrez-dev/Tiva-TM4C123GXL-Peripheral-Driver-Development/drivers/src/tm4c123x_i2c_driver.c
    /* Set slave address in MSA register with R/S bit = 1 (receive mode) */
    pI2CHandle->pI2Cx->MSA = (SlaveAddr << 1) | 1;  /* R/S=1 for receive */

    /* Handle single byte reception (Figure 16-9) */
    if (Len == 1)
    {
        /* Single byte: START + RUN + STOP (0x07)
         * Hardware automatically NAKs the single byte */
        pI2CHandle->pI2Cx->MCS = (1 << I2C_MCS_START) |
                                  (1 << I2C_MCS_RUN) |
                                  (1 << I2C_MCS_STOP);

        /* Wait for BUSY to clear */
        timeout = 100000;
        while ((pI2CHandle->pI2Cx->MCS & (1 << I2C_MCS_BUSY)) && timeout--);

        /* Read the received byte from MDR */
        *pRxBuffer = (uint8_t)(pI2CHandle->pI2Cx->MDR & 0xFF);
    }
    /* Handle multi-byte reception (Figure 16-11) */
    else
    {
        uint32_t i;

        /* First byte: START + RUN + ACK (0x0B) */
        pI2CHandle->pI2Cx->MCS = (1 << I2C_MCS_START) |
                                  (1 << I2C_MCS_RUN) |
                                  (1 << I2C_MCS_ACK);

        /* Wait for BUSY to clear */
        timeout = 100000;
        while ((pI2CHandle->pI2Cx->MCS & (1 << I2C_MCS_BUSY)) && timeout--);
        if (timeout == 0) return;

        /* Read first byte */
        *pRxBuffer = (uint8_t)(pI2CHandle->pI2Cx->MDR & 0xFF);
        pRxBuffer++;

        /* Loop through remaining bytes (2 to Len) */
        for (i = 1; i < Len; i++)
        {
            /* Check if this is the last byte */
            if (i == (Len - 1))
            {
                /* Last byte: STOP + RUN (0x05) - sends NACK after this byte */
                pI2CHandle->pI2Cx->MCS = (1 << I2C_MCS_RUN) |
                                          (1 << I2C_MCS_STOP);
            }
            else
            {
                /* Middle bytes: RUN + ACK (0x09) - sends ACK after this byte */
                pI2CHandle->pI2Cx->MCS = (1 << I2C_MCS_RUN) |
                                          (1 << I2C_MCS_ACK);
            }

            /* Wait for BUSY to clear */
            timeout = 100000;
            while ((pI2CHandle->pI2Cx->MCS & (1 << I2C_MCS_BUSY)) && timeout--);
            if (timeout == 0) return;

            /* Read received byte */
            *pRxBuffer = (uint8_t)(pI2CHandle->pI2Cx->MDR & 0xFF);
            pRxBuffer++;
        }
    }

    /* Note: Repeated start (Sr parameter) not yet implemented
     * This implementation always sends STOP condition */
}

uint8_t I2C_MasterSendDataIT(I2C_Handle_t *pI2CHandle, uint8_t *pTxbuffer, uint32_t Len, uint8_t SlaveAddr, uint8_t Sr)
{
    /* TODO: Implement interrupt-based master send */
    return I2C_READY;
}

uint8_t I2C_MasterReceiveDataIT(I2C_Handle_t *pI2CHandle, uint8_t *pRxBuffer, uint32_t Len, uint8_t SlaveAddr, uint8_t Sr)
{
    /* TODO: Implement interrupt-based master receive */
    return I2C_READY;
}

void I2C_CloseReceiveData(I2C_Handle_t *pI2CHandle)
{
    /* TODO: Implement close receive logic */
}

void I2C_CloseSendData(I2C_Handle_t *pI2CHandle)
{
    /* TODO: Implement close send logic */
}

void I2C_SlaveSendData(I2C_RegDef_t *pI2Cx, uint8_t data)
{
    /* TODO: Implement slave send */
    pI2Cx->SDR = data;
}

uint8_t I2C_SlaveReceiveData(I2C_RegDef_t *pI2Cx)
{
    volatile uint32_t timeout = 100000;
    uint8_t data;

    /* Wait for receive request - first RREQ might be for address byte */
    while (!(pI2Cx->SCSR & (1 << I2C_SCSR_RREQ)) && timeout--);

    /* Check if this is the first byte (data) or just address match
     * FBR bit is set when we have actual data, not just address
     */
    if (pI2Cx->SCSR & (1 << I2C_SCSR_FBR)) {
        /* FBR is set - we have data, read it directly */
        data = (uint8_t)(pI2Cx->SDR & 0xFF);
    } else {
        /* FBR not set - might be address byte still in SDR
         * Do a dummy read to clear it, then wait for actual data
         */
        (void)(pI2Cx->SDR);  /* Dummy read to clear address byte */

        /* Wait for next RREQ - this should be the actual data */
        timeout = 100000;
        while (!(pI2Cx->SCSR & (1 << I2C_SCSR_RREQ)) && timeout--);

        /* Now read the actual data */
        data = (uint8_t)(pI2Cx->SDR & 0xFF);
    }

    return data;
}

void I2C_IRQInterruptConfig(uint8_t IRQNumber, uint8_t EnorDi)
{
    /* TODO: Implement IRQ configuration */
}

void I2C_IRQPriorityConfig(uint8_t IRQNumber, uint32_t IRQPriority)
{
    /* TODO: Implement IRQ priority configuration */
}

void I2C_EV_IRQHandling(I2C_Handle_t *pI2CHandle)
{
    /* TODO: Implement event IRQ handling */
}

void I2C_ER_IRQHandling(I2C_Handle_t *pI2CHandle)
{
    /* TODO: Implement error IRQ handling */
}

void I2C_ManageAcking(I2C_RegDef_t *pI2Cx, uint8_t EnorDi)
{
    /* Note: ACK is controlled per-transaction in MCS register for TM4C123x
     * This is a placeholder for API compatibility
     */
}

__weak void I2C_ApplicationEventCallback(I2C_Handle_t *pI2CHandle, uint8_t AppEv)
{
    /* Weak implementation - application should override this function */
}
